---
kind: enumMember
id: F:Autodesk.Revit.DB.IFCVersion.IFCBCA
enum: Autodesk.Revit.DB.IFCVersion
source: html/03f1bce3-dd39-9deb-c732-db82474cb40b.htm
---
# Autodesk.Revit.DB.IFCVersion.IFCBCA

IFC BCA file format. This is a certified variant of IFC 2x2 used for
 submitting files to the Singapore BCA ePlan Check Server.